posts/2015-01-13-the-eighteenth-sunday-after-pentecost.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: The Eighteenth Sunday After Pentecost

Holy God,

Examine our hearts,\\
and test our wills\\
against your own.\\

We pray for the coming of your Kingdom\\
here, on earth,\\
even as it is in heaven.\\

Yet we confess that sometimes,\\
these are just sounds made with our voices,\\
not reflections of the desires of our hearts.\\
For in that day,\\
the high shall be brought down\\
and the low shall be lifted up\\
and compared to most,\\
we live in power, prestige, and comfort.

At other times, the words are sincere,\\
a promise that we fear can never be fulfilled,\\
for the death, sickness, pain, and loss often\\
seem more real to us than the words that we pray.\\

Yet you know this, Lord,\\
You know our deepest secrets, frailties, and deceits,\\
and ask us to pray anyway,\\
for our prayers may\\
turn to hopes,\\
our hopes, to dreams,\\
and our dreams,\\
to a new vision of what can truly be.

May it begin, here, in this place,\\
with us, your people,\\
by the power of the Spirit,\\
the abundant grace of the Father,\\
and the sacrificial love of the Son.

/Amen/


#+begin_tagline
Tagged: prayer
#+end_tagline
