docs/posts/2015-01-13-the-eighteenth-sunday-after-pentecost.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Eighteenth Sunday After Pentecost</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Eighteenth Sunday After Pentecost</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
Holy God,
</p>

<p>
Examine our hearts,<br>
and test our wills<br>
against your own.<br>
</p>

<p>
We pray for the coming of your Kingdom<br>
here, on earth,<br>
even as it is in heaven.<br>
</p>

<p>
Yet we confess that sometimes,<br>
these are just sounds made with our voices,<br>
not reflections of the desires of our hearts.<br>
For in that day,<br>
the high shall be brought down<br>
and the low shall be lifted up<br>
and compared to most,<br>
we live in power, prestige, and comfort.
</p>

<p>
At other times, the words are sincere,<br>
a promise that we fear can never be fulfilled,<br>
for the death, sickness, pain, and loss often<br>
seem more real to us than the words that we pray.<br>
</p>

<p>
Yet you know this, Lord,<br>
You know our deepest secrets, frailties, and deceits,<br>
and ask us to pray anyway,<br>
for our prayers may<br>
turn to hopes,<br>
our hopes, to dreams,<br>
and our dreams,<br>
to a new vision of what can truly be.
</p>

<p>
May it begin, here, in this place,<br>
with us, your people,<br>
by the power of the Spirit,<br>
the abundant grace of the Father,<br>
and the sacrificial love of the Son.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org035a5fc">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
